{%%%Example 11%%%}
***
---
___
{%%%Example 12%%%}
+++
{%%%Example 13%%%}
===
{%%%Example 14%%%}
--
**
__
{%%%Example 15%%%}
 ***
  ***
   ***
{%%%Example 16%%%}
    ***
{%%%Example 17%%%}
Foo
    ***
{%%%Example 18%%%}
_____________________________________
{%%%Example 19%%%}
 - - -
{%%%Example 20%%%}
 **  * ** * ** * **
{%%%Example 21%%%}
-     -      -      -
{%%%Example 22%%%}
- - - -    
{%%%Example 23%%%}
_ _ _ _ a

a------

---a---
{%%%Example 24%%%}
 *-*
{%%%Example 25%%%}
- foo
***

- bar
{%%%Example 26%%%}
Foo
***
bar
{%%%Example 27%%%}
Foo
---
bar
{%%%Example 28%%%}
* Foo
* * *
* Bar
{%%%Example 29%%%}
- Foo
- * * *
{%%%Example 30%%%}
# foo
## foo
### foo
#### foo
##### foo
###### foo
{%%%Example 31%%%}
####### foo
{%%%Example 32%%%}
#5 bolt

#hashtag
{%%%Example 33%%%}
#	foo
{%%%Example 34%%%}
\## foo
{%%%Example 35%%%}
# foo *bar* \*baz\*
{%%%Example 36%%%}
#                  foo                     
{%%%Example 37%%%}
 ### foo
  ## foo
   # foo
{%%%Example 38%%%}
    # foo
{%%%Example 39%%%}
foo
    # bar
{%%%Example 40%%%}
## foo ##
  ###   bar    ###
{%%%Example 41%%%}
# foo ##################################
##### foo ##
{%%%Example 42%%%}
### foo ###     
{%%%Example 43%%%}
### foo ### b
{%%%Example 44%%%}
# foo#
{%%%Example 45%%%}
### foo \###
## foo #\##
# foo \#
{%%%Example 46%%%}
****
## foo
****
{%%%Example 47%%%}
Foo bar
# baz
Bar foo
{%%%Example 48%%%}
## 
#
### ###
{%%%Example 49%%%}
Foo *bar*
=========

Foo *bar*
---------
{%%%Example 50%%%}
Foo *bar
baz*
====
{%%%Example 51%%%}
Foo
-------------------------

Foo
=
{%%%Example 52%%%}
   Foo
---

  Foo
-----

  Foo
  ===
{%%%Example 53%%%}
    Foo
    ---

    Foo
---
{%%%Example 54%%%}
Foo
   ----      
{%%%Example 55%%%}
Foo
    ---
{%%%Example 56%%%}
Foo
= =

Foo
--- -
{%%%Example 57%%%}
Foo  
-----
{%%%Example 58%%%}
Foo\
----
{%%%Example 59%%%}
`Foo
----
`

<a title="a lot
---
of dashes"/>
{%%%Example 60%%%}
> Foo
---
{%%%Example 61%%%}
> foo
bar
===
{%%%Example 62%%%}
- Foo
---
{%%%Example 63%%%}
Foo
Bar
---
{%%%Example 64%%%}
---
Foo
---
Bar
---
Baz
{%%%Example 65%%%}

====
{%%%Example 66%%%}
---
---
{%%%Example 67%%%}
- foo
-----
{%%%Example 68%%%}
    foo
---
{%%%Example 69%%%}
> foo
-----
{%%%Example 70%%%}
\> foo
------
{%%%Example 71%%%}
Foo

bar
---
baz
{%%%Example 72%%%}
Foo
bar

---

baz
{%%%Example 73%%%}
Foo
bar
* * *
baz
{%%%Example 74%%%}
Foo
bar
\---
baz
{%%%Example 75%%%}
    a simple
      indented code block
{%%%Example 76%%%}
  - foo

    bar
{%%%Example 77%%%}
1.  foo

    - bar
{%%%Example 78%%%}
    <a/>
    *hi*

    - one
{%%%Example 79%%%}
    chunk1

    chunk2
  
 
 
    chunk3
{%%%Example 80%%%}
    chunk1
      
      chunk2
{%%%Example 81%%%}
Foo
    bar
{%%%Example 82%%%}
    foo
bar
{%%%Example 83%%%}
# Heading
    foo
Heading
------
    foo
----
{%%%Example 84%%%}
        foo
    bar
{%%%Example 85%%%}

    
    foo
    
{%%%Example 86%%%}
    foo  
{%%%Example 87%%%}
```
<
 >
```
{%%%Example 88%%%}
~~~
<
 >
~~~
{%%%Example 89%%%}
```
aaa
~~~
```
{%%%Example 90%%%}
~~~
aaa
```
~~~
{%%%Example 91%%%}
````
aaa
```
``````
{%%%Example 92%%%}
~~~~
aaa
~~~
~~~~
{%%%Example 93%%%}
```
{%%%Example 94%%%}
`````

```
aaa
{%%%Example 95%%%}
> ```
> aaa

bbb
{%%%Example 96%%%}
```

  
```
{%%%Example 97%%%}
```
```
{%%%Example 98%%%}
 ```
 aaa
aaa
```
{%%%Example 99%%%}
  ```
aaa
  aaa
aaa
  ```
{%%%Example 100%%%}
   ```
   aaa
    aaa
  aaa
   ```
{%%%Example 101%%%}
    ```
    aaa
    ```
{%%%Example 102%%%}
```
aaa
  ```
{%%%Example 103%%%}
   ```
aaa
  ```
{%%%Example 104%%%}
```
aaa
    ```
{%%%Example 105%%%}
``` ```
aaa
{%%%Example 106%%%}
~~~~~~
aaa
~~~ ~~
{%%%Example 107%%%}
foo
```
bar
```
baz
{%%%Example 108%%%}
foo
---
~~~
bar
~~~
# baz
{%%%Example 109%%%}
```ruby
def foo(x)
  return 3
end
```
{%%%Example 110%%%}
~~~~    ruby startline=3 $%@#$
def foo(x)
  return 3
end
~~~~~~~
{%%%Example 111%%%}
````;
````
{%%%Example 112%%%}
``` aa ```
foo
{%%%Example 113%%%}
```
``` aaa
```
{%%%Example 114%%%}
<table>
  <tr>
    <td>
           hi
    </td>
  </tr>
</table>

okay.
{%%%Example 115%%%}
 <div>
  *hello*
         <foo><a>
{%%%Example 116%%%}
</div>
*foo*
{%%%Example 117%%%}
<DIV CLASS="foo">

*Markdown*

</DIV>
{%%%Example 118%%%}
<div id="foo"
  class="bar">
</div>
{%%%Example 119%%%}
<div id="foo" class="bar
  baz">
</div>
{%%%Example 120%%%}
<div>
*foo*

*bar*
{%%%Example 121%%%}
<div id="foo"
*hi*
{%%%Example 122%%%}
<div class
foo
{%%%Example 123%%%}
<div *???-&&&-<---
*foo*
{%%%Example 124%%%}
<div><a href="bar">*foo*</a></div>
{%%%Example 125%%%}
<table><tr><td>
foo
</td></tr></table>
{%%%Example 126%%%}
<div></div>
``` c
int x = 33;
```
{%%%Example 127%%%}
<a href="foo">
*bar*
</a>
{%%%Example 128%%%}
<Warning>
*bar*
</Warning>
{%%%Example 129%%%}
<i class="foo">
*bar*
</i>
{%%%Example 130%%%}
</ins>
*bar*
{%%%Example 131%%%}
<del>
*foo*
</del>
{%%%Example 132%%%}
<del>

*foo*

</del>
{%%%Example 133%%%}
<del>*foo*</del>
{%%%Example 134%%%}
<pre language="haskell"><code>
import Text.HTML.TagSoup

main :: IO ()
main = print $ parseTags tags
</code></pre>
{%%%Example 135%%%}
<script type="text/javascript">
// JavaScript example

document.getElementById("demo").innerHTML = "Hello JavaScript!";
</script>
{%%%Example 136%%%}
<style
  type="text/css">
h1 {color:red;}

p {color:blue;}
</style>
{%%%Example 137%%%}
<style
  type="text/css">

foo
{%%%Example 138%%%}
> <div>
> foo

bar
{%%%Example 139%%%}
- <div>
- foo
{%%%Example 140%%%}
<style>p{color:red;}</style>
*foo*
{%%%Example 141%%%}
<!-- foo -->*bar*
*baz*
{%%%Example 142%%%}
<script>
foo
</script>1. *bar*
{%%%Example 143%%%}
<!-- Foo

bar
   baz -->
{%%%Example 144%%%}
<?php

  echo '>';

?>
{%%%Example 145%%%}
<!DOCTYPE html>
{%%%Example 146%%%}
<![CDATA[
function matchwo(a,b)
{
  if (a < b && a < 0) then {
    return 1;

  } else {

    return 0;
  }
}
]]>
{%%%Example 147%%%}
  <!-- foo -->

    <!-- foo -->
{%%%Example 148%%%}
  <div>

    <div>
{%%%Example 149%%%}
Foo
<div>
bar
</div>
{%%%Example 150%%%}
<div>
bar
</div>
*foo*
{%%%Example 151%%%}
Foo
<a href="bar">
baz
{%%%Example 152%%%}
<div>

*Emphasized* text.

</div>
{%%%Example 153%%%}
<div>
*Emphasized* text.
</div>
{%%%Example 154%%%}
<table>

<tr>

<td>
Hi
</td>

</tr>

</table>
{%%%Example 155%%%}
<table>

  <tr>

    <td>
      Hi
    </td>

  </tr>

</table>
{%%%Example 156%%%}
[foo]: /url "title"

[foo]
{%%%Example 157%%%}
   [foo]: 
      /url  
           'the title'  

[foo]
{%%%Example 158%%%}
[Foo*bar\]]:my_(url) 'title (with parens)'

[Foo*bar\]]
{%%%Example 159%%%}
[Foo bar]:
<my%20url>
'title'

[Foo bar]
{%%%Example 160%%%}
[foo]: /url '
title
line1
line2
'

[foo]
{%%%Example 161%%%}
[foo]: /url 'title

with blank line'

[foo]
{%%%Example 162%%%}
[foo]:
/url

[foo]
{%%%Example 163%%%}
[foo]:

[foo]
{%%%Example 164%%%}
[foo]: /url\bar\*baz "foo\"bar\baz"

[foo]
{%%%Example 165%%%}
[foo]

[foo]: url
{%%%Example 166%%%}
[foo]

[foo]: first
[foo]: second
{%%%Example 167%%%}
[FOO]: /url

[Foo]
{%%%Example 168%%%}
[ΑΓΩ]: /φου

[αγω]
{%%%Example 170%%%}
[
foo
]: /url
bar
{%%%Example 171%%%}
[foo]: /url "title" ok
{%%%Example 172%%%}
[foo]: /url
"title" ok
{%%%Example 173%%%}
    [foo]: /url "title"

[foo]
{%%%Example 174%%%}
```
[foo]: /url
```

[foo]
{%%%Example 175%%%}
Foo
[bar]: /baz

[bar]
{%%%Example 176%%%}
# [Foo]
[foo]: /url
> bar
{%%%Example 177%%%}
[foo]: /foo-url "foo"
[bar]: /bar-url
  "bar"
[baz]: /baz-url

[foo],
[bar],
[baz]
{%%%Example 178%%%}
[foo]

> [foo]: /url
{%%%Example 179%%%}
aaa

bbb
{%%%Example 180%%%}
aaa
bbb

ccc
ddd
{%%%Example 181%%%}
aaa


bbb
{%%%Example 182%%%}
  aaa
 bbb
{%%%Example 183%%%}
aaa
             bbb
                                       ccc
{%%%Example 184%%%}
   aaa
bbb
{%%%Example 185%%%}
    aaa
bbb
{%%%Example 186%%%}
aaa     
bbb     
{%%%Example 187%%%}


  

aaa
  

# aaa

  

{%%%Example 188%%%}
> # Foo
> bar
> baz
{%%%Example 189%%%}
># Foo
>bar
> baz
{%%%Example 190%%%}
   > # Foo
   > bar
 > baz
{%%%Example 191%%%}
    > # Foo
    > bar
    > baz
{%%%Example 192%%%}
> # Foo
> bar
baz
{%%%Example 193%%%}
> bar
baz
> foo
{%%%Example 194%%%}
> foo
---
{%%%Example 195%%%}
> - foo
- bar
{%%%Example 196%%%}
>     foo
    bar
{%%%Example 197%%%}
> ```
foo
```
{%%%Example 198%%%}
> foo
    - bar
{%%%Example 199%%%}
>
{%%%Example 200%%%}
>
>  
> 
{%%%Example 201%%%}
>
> foo
>  
{%%%Example 202%%%}
> foo

> bar
{%%%Example 203%%%}
> foo
> bar
{%%%Example 204%%%}
> foo
>
> bar
{%%%Example 205%%%}
foo
> bar
{%%%Example 206%%%}
> aaa
***
> bbb
{%%%Example 207%%%}
> bar
baz
{%%%Example 208%%%}
> bar

baz
{%%%Example 209%%%}
> bar
>
baz
{%%%Example 210%%%}
> > > foo
bar
{%%%Example 211%%%}
>>> foo
> bar
>>baz
{%%%Example 212%%%}
>     code

>    not code
{%%%Example 213%%%}
A paragraph
with two lines.

    indented code

> A block quote.
{%%%Example 214%%%}
1.  A paragraph
    with two lines.

        indented code

    > A block quote.
{%%%Example 215%%%}
- one

 two
{%%%Example 216%%%}
- one

  two
{%%%Example 217%%%}
 -    one

     two
{%%%Example 218%%%}
 -    one

      two
{%%%Example 219%%%}
   > > 1.  one
>>
>>     two
{%%%Example 220%%%}
>>- one
>>
  >  > two
{%%%Example 221%%%}
-one

2.two
{%%%Example 222%%%}
- foo

  bar

- foo


  bar

- ```
  foo


  bar
  ```

- baz

  + ```
    foo


    bar
    ```
{%%%Example 223%%%}
1.  foo

    ```
    bar
    ```

    baz

    > bam
{%%%Example 224%%%}
- Foo

      bar

      baz
{%%%Example 225%%%}
- Foo

      bar


      baz
{%%%Example 226%%%}
123456789. ok
{%%%Example 227%%%}
1234567890. not ok
{%%%Example 228%%%}
0. ok
{%%%Example 229%%%}
003. ok
{%%%Example 230%%%}
-1. not ok
{%%%Example 231%%%}
- foo

      bar
{%%%Example 232%%%}
  10.  foo

           bar
{%%%Example 233%%%}
    indented code

paragraph

    more code
{%%%Example 234%%%}
1.     indented code

   paragraph

       more code
{%%%Example 235%%%}
1.      indented code

   paragraph

       more code
{%%%Example 236%%%}
   foo

bar
{%%%Example 237%%%}
-    foo

  bar
{%%%Example 238%%%}
-  foo

   bar
{%%%Example 239%%%}
-
  foo
-
  ```
  bar
  ```
-
      baz
{%%%Example 240%%%}
-

  foo
{%%%Example 241%%%}
- foo
-
- bar
{%%%Example 242%%%}
- foo
-   
- bar
{%%%Example 243%%%}
1. foo
2.
3. bar
{%%%Example 244%%%}
*
{%%%Example 245%%%}
 1.  A paragraph
     with two lines.

         indented code

     > A block quote.
{%%%Example 246%%%}
  1.  A paragraph
      with two lines.

          indented code

      > A block quote.
{%%%Example 247%%%}
   1.  A paragraph
       with two lines.

           indented code

       > A block quote.
{%%%Example 248%%%}
    1.  A paragraph
        with two lines.

            indented code

        > A block quote.
{%%%Example 249%%%}
  1.  A paragraph
with two lines.

          indented code

      > A block quote.
{%%%Example 250%%%}
  1.  A paragraph
    with two lines.
{%%%Example 251%%%}
> 1. > Blockquote
continued here.
{%%%Example 252%%%}
> 1. > Blockquote
> continued here.
{%%%Example 253%%%}
- foo
  - bar
    - baz
{%%%Example 254%%%}
- foo
 - bar
  - baz
{%%%Example 255%%%}
10) foo
    - bar
{%%%Example 256%%%}
10) foo
   - bar
{%%%Example 257%%%}
- - foo
{%%%Example 258%%%}
1. - 2. foo
{%%%Example 259%%%}
- # Foo
- Bar
  ---
  baz
{%%%Example 260%%%}
- foo
- bar
+ baz
{%%%Example 261%%%}
1. foo
2. bar
3) baz
{%%%Example 262%%%}
Foo
- bar
- baz
{%%%Example 263%%%}
The number of windows in my house is
14.  The number of doors is 6.
{%%%Example 264%%%}
- foo

- bar


- baz
{%%%Example 265%%%}
- foo


  bar
- baz
{%%%Example 266%%%}
- foo
  - bar
    - baz


      bim
{%%%Example 267%%%}
- foo
- bar


- baz
- bim
{%%%Example 268%%%}
-   foo

    notcode

-   foo


    code
{%%%Example 269%%%}
- a
 - b
  - c
   - d
    - e
   - f
  - g
 - h
- i
{%%%Example 270%%%}
1. a

  2. b

    3. c
{%%%Example 271%%%}
- a
- b

- c
{%%%Example 272%%%}
* a
*

* c
{%%%Example 273%%%}
- a
- b

  c
- d
{%%%Example 274%%%}
- a
- b

  [ref]: /url
- d
{%%%Example 275%%%}
- a
- ```
  b


  ```
- c
{%%%Example 276%%%}
- a
  - b

    c
- d
{%%%Example 277%%%}
* a
  > b
  >
* c
{%%%Example 278%%%}
- a
  > b
  ```
  c
  ```
- d
{%%%Example 279%%%}
- a
{%%%Example 280%%%}
- a
  - b
{%%%Example 281%%%}
1. ```
   foo
   ```

   bar
{%%%Example 282%%%}
* foo
  * bar

  baz
{%%%Example 283%%%}
- a
  - b
  - c

- d
  - e
  - f